app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
    def index
        render(json: { tweets: Tweet.all })

INSERT INTO "tweets" ("title", "content", "author") VALUES ($1, $2, $3) RETURNING "id"  [["title", "test"], ["content", "test"], ["author", "test"]]
---
    def create
        tweet = Tweet.new(tweet_params)

        if tweet.save